Repository: pingfangx/TranslatorX-other
Catalog: AndroidDocs/omegat/project_save.tmx
Source language: en_us
Languages: zh_cn

source: The PieChart example is a little different: it uses the current scroll y position to set the rotational angle of the chart.
zh_cn: 饼图示例略有不同：它使用当前滚动 y 位置来设置图表的旋转角度。

source: The PieChart example shows how to extend ViewGroup as part of a custom view.
zh_cn: PieChart 示例显示如何将 ViewGroup 继承为自定义 view 的一部分。

source: The PieChart example uses the second approach.
zh_cn: PieChart 示例使用第二种方法。

source: The Recycler that can be used to bind the View
zh_cn: 可用于绑定 view 的 Recycler

source: The RecyclerView instance which started observing this adapter.
zh_cn: 开始观察此适配器的 RecyclerView 实例。

source: The RecyclerView instance which stopped observing this adapter.
zh_cn: 已停止观察此适配器的 RecyclerView 实例。

source: The RecyclerView is currently animating to a final position while not under outside control.
zh_cn: RecyclerView 当前在不受外界输入控制的情况下，动画至最终的位置。

source: The RecyclerView is currently being dragged by outside input such as user touch input.
zh_cn: RecyclerView 当前正在被外部的输入（比如用户的触摸输入）拖动。

source: The RecyclerView is not currently scrolling.
zh_cn: RecyclerView 当前没有滚动。

source: The Surface will be created for you while the SurfaceView's window is visible; you should implement SurfaceHolder.Callback#surfaceCreated and SurfaceHolder.Callback#surfaceDestroyed to discover when the Surface is created and destroyed as the window is shown and hidden.
zh_cn: 当 SurfaceView 的窗口可见时，将为你创建 Surface;你应该实现 SurfaceHolder.Callback#surfaceCreated 和 SurfaceHolder.Callback#surfaceDestroyed 在窗口显示和隐藏时发现 Surface 的创建和销毁。

source: The SwipeRefreshLayout does not provide accessibility events; instead, a menu item must be provided to allow refresh of the content wherever this gesture is used.
zh_cn: SwipeRefreshLayout 不提供辅助功能事件；相反，必须提供菜单项以允许在使用该手势的任何地方刷新内容。

source: The SwipeRefreshLayout should be used whenever the user can refresh the contents of a view via a vertical swipe gesture.
zh_cn: 只要用户可以通过垂直滑动手势刷新 view 的内容，就应该使用 SwipeRefreshLayout。

source: The SwipeRefreshLayout will notify the listener each and every time the gesture is completed again; the listener is responsible for correctly determining when to actually initiate a refresh of its content.
zh_cn: SwipeRefreshLayout 将在每次手势再次完成时通知监听器；监听器负责正确地确定何时实际启动其内容的刷新。

source: The TvView class provides a high level interface for applications to show TV programs from various TV sources that implement TvInputService.
zh_cn: TvView 类为应用程序提供高级接口，以显示实现 TvInputService 的各种电视源的电视节目。

source: The VideoView class can load images from various sources (such as resources or content providers), takes care of computing its measurement from the video so that it can be used in any layout manager, and provides various display options such as scaling and tinting.
zh_cn: VideoView 类可以从各种来源(例如资源或内容提供者)加载图像，负责从视频计算其测量值，以便可以在任何布局管理器中使用，并提供各种显示选项，如缩放和着色。

source: The View class exposes an ALPHA property, as well as several transform-related properties, such as TRANSLATION_X and TRANSLATION_Y.
zh_cn: View 类公开 ALPHA 及一些移动相关的属性，比如 TRANSLATION_X 、TRANSLATION_Y 等。

source: The View created by inflating the layout resource "mySubTree" can be found using the id "subTree," specified by the inflatedId property.
zh_cn: 通过加载布局资源“mySubTree”创建的view可以使用由 inflatedId 属性指定的 id “subTree”找到。

source: The View will be displayed as a single row that spans all the table columns.
zh_cn: view 将显示为跨越所有表列的单行。

source: The ViewGroup into which the new View will be added after it is bound to an adapter position.
zh_cn: 新 View 绑定到适配器位置后将添加到其中的 ViewGroup。

source: The ViewHolder containing the View that could not be recycled due to its transient state.
zh_cn: 包含由于其 transient 状态而无法回收的 View 的 ViewHolder。

source: The ViewHolder which should be updated to represent the contents of the item at the given position in the data set.
zh_cn: 应更新以表示数据集中给定位置处项的内容的 ViewHolder。

source: The ViewStub then replaces itself in its parent with the inflated View or Views.
zh_cn: 然后，ViewStub 会在其父级中使用加载的 view 或 views 替换自身。

source: The ViewStub thus defined can be found using the id "stub." After inflation of the layout resource "mySubTree," the ViewStub is removed from its parent.
zh_cn: 可以使用 id “stub”找到如此定义的 ViewStub。在布局资源“mySubTree”加载之后，ViewStub 将从其父级中移除。

source: The WebP format provides lossy compression (like JPEG) as well as transparency (like PNG) but can provide better compression than either JPEG or PNG.
zh_cn: WebP 格式提供有损压缩(如 JPEG)以及透明度(如 PNG)，但可以提供比 JPEG 或 PNG 更好的压缩。

source: The above snippet creates an instance of View.OnClickListener and wires the listener to the button using setOnClickListener(View.OnClickListener).
zh_cn: 上面的代码片段创建 View.OnClickListener 的实例，并使用 setOnClickListener(View.OnClickListener) 将监听器连接到按钮。

source: The accessibility focus didn't handle the event, so clear the flag and do a normal dispatch to all children.
zh_cn: 无障碍焦点无法处理该事件，因此请清除标志并对所有子项执行正常分派。

source: The action bar appears at the top of an activity's window when the activity uses the AppCompat's AppCompat theme (or one of its descendant themes).
zh_cn: 当 activity 使用 AppCompat 的 AppCompat 主题(或其后代主题之一)时，操作栏将显示在 activity 窗口的顶部。

source: The action bar may be represented by any Toolbar widget within the application layout.
zh_cn: 操作栏可以由应用程序布局中的任何工具栏部件(Toolbar widget)表示。

source: The activity that instantiates this view should add an OnRefreshListener to be notified whenever the swipe to refresh gesture is completed.
zh_cn: 实例化此 view 的 activity 应添加 OnRefreshListener，以便在滑动刷新手势完成时通知。

source: The actual permissions required will depend on the particular intent passed in.
zh_cn: 实际所需的权限将取决于传递的特定的 intent 。

source: The adapter is responsible for adding the view to the container given here, although it only must ensure this is done by the time it returns from finishUpdate(ViewGroup).
zh_cn: 适配器负责往给定的的容器中添加视图，尽管它只必须确保在从 finishUpdate(ViewGroup) 返回的时间完成此操作。

source: The adapter is responsible for removing the view from its container, although it only must ensure this is done by the time it returns from finishUpdate(ViewGroup).
zh_cn: 适配器负责从其容器中删除视图，尽管它只必须确保在从 finishUpdate(ViewGroup) 返回的时间完成此操作。

source: The adapter may publish a variety of events describing specific changes.
zh_cn: 适配器可以发布描述特定更改的各种事件。

source: The adapter position
zh_cn: 适配器位置

source: The alpha component is passed through unchanged.
zh_cn: alpha 分量不变地传递。

source: The alpha to apply to the indicator when disabled.
zh_cn: 禁用时应用于指示器的 Alpha。

source: The amount of friction applied to flings.
zh_cn: 施加在 fling 上的摩擦力。

source: The animation can alter the scale, rotation, translation and alpha of a view over time.
zh_cn: 动画可以随时间改变 scale (缩放)，rotation (旋转)，translation (平移)和 alpha (透明度)。

source: The application may signal to the Activity which Toolbar should be treated as the Activity's action bar.
zh_cn: 应用程序可能会向 Activity 发信号通知哪个工具栏应被视为 activity 的操作栏。

source: The attribute layout_constraintHorizontal_weight and layout_constraintVertical_weight will control how the space will be distributed among the elements using MATCH_CONSTRAINT.
zh_cn: 属性 layout_constraintHorizontal_weight 和 layout_constraintVertical_weight 将会控制如何在使用 MATCH_CONSTRAINT 的属性之间分配空间。

source: The available properties and the methods that set them will vary among the different subclasses of views.
zh_cn: 可用的属性和方法，因不同的 view 子类而不同。

source: The background color for the header's day of week.
zh_cn: 标题星期几的背景颜色。

source: The background color for the selected week.
zh_cn: 所选周的背景颜色。

source: The background color of this view defaults to the your theme's colorAccent.
zh_cn: 此 view 的背景颜色默认为主题的 colorAccent。

source: The background color of this view defaults to the your theme's colorPrimary.
zh_cn: 此 view 的背景颜色默认为主题的 colorPrimary。

source: The background for the selected date header.
zh_cn: 所选日期标题的背景。

source: The background to use for the popup window.
zh_cn: 用于弹出窗口的背景。

source: The bar can disappear on scroll, based on HideBottomViewOnScrollBehavior, when it is placed within a CoordinatorLayout and one of the children within the CoordinatorLayout is scrolled.
zh_cn: 基于 HideBottomViewOnScrollBehavior，当它放在 CoordinatorLayout 中并且其中一个 CoordinatorLayout 中的子项滚动时，该栏可以在滚动时消失。

source: The bar contents can be populated by specifying a menu resource file.
zh_cn: 可以通过指定菜单资源文件来填充栏内容。

source: The base LayoutParams class just describes how big the view wants to be for both width and height.
zh_cn: 基本的 LayoutParams 类只描述了 view 的宽高想要多大。

source: The base class implementation of measure defaults to the background size, unless a larger size is allowed by the MeasureSpec.
zh_cn: 实现测量的基本类默认是背景的大小，除非 MeasureSpec 允许一个更大的值。

source: The baseline of the text in a view.
zh_cn: view 中的文本的基线。

source: The basic attributes you can set are:
zh_cn: 你可以设置的基本属性是：

source: The basic cycle of a view is as follows:
zh_cn: view 的基本周期如下：

source: The behavior associated with the matching View class.
zh_cn: 与匹配 View 类关联的行为。

source: The behavior mirrors that of RadioGroup.
zh_cn: 该行为反映了 RadioGroup 的行为。

source: The best part of this approach is that it extends to any arbitrary changes - item updates, moves, addition and removal can all be computed and handled the same way.
zh_cn: 这种方法的最佳部分是它可以扩展到任意变化 - 项目更新，移动，添加和移除都可以以相同的方式计算和处理。

source: The binding is done through the AppBarLayout.ScrollingViewBehavior behavior class, meaning that you should set your scrolling view's behavior to be an instance of AppBarLayout.ScrollingViewBehavior.
zh_cn: 绑定是通过 AppBarLayout.ScrollingViewBehavior 行为类完成的，这意味着你应该将滚动 view 的行为设置为 AppBarLayout.ScrollingViewBehavior。

source: The bitmap can be repeated or mirrored by setting the tiling mode.
zh_cn: 位图可以通过设置 tiling mode （平铺模式）来重复或镜像。

source: The border is used to define the stretchable and static areas of the image.
zh_cn: 该边框用来定义图形中可伸缩的和固定的区域。

source: The bottom and right lines define the relative area within the image that the contents of the View are allowed to lie within.
zh_cn: 底部和右边的线定义了图形内允许绘制内容的相关区域。

source: The bottom margin to use when the target is gone.
zh_cn: 当目标 gone 时使用的底部 margin。

source: The bottom side of a view.
zh_cn: view 的底边。

source: The build system then prevents resources from other, unsupported configurations from appearing in the APK, reducing the APK's size.
zh_cn: 然后，构建系统会阻止来自其他不受支持的配置的资源出现在 APK 中，从而减少 APK 的大小。

source: The button is being released before we actually showed it as pressed.
zh_cn: 这个按钮在我们实际显示按下之前就被释放了。

source: The calculations take into account the view's padding.
zh_cn: 计算考虑了 view 的 padding。

source: The call to fling() sets up the physics model for the fling gesture.
zh_cn: 对 fling() 的调用设置了投掷手势的物理模型。

source: The callback interface used to indicate the time has been adjusted.
zh_cn: 回调接口用于指示时间已调整。

source: The callback used to indicate the user changed the date.
zh_cn: 回调用于指示用户更改了日期。

source: The callback used to indicate the user changes the date.
zh_cn: 用于指示用户更改日期的回调。

source: The caller must call #clearScrap() when it's done to update the recycler's internal bookkeeping.
zh_cn: 调用方必须在更新回收方的内部记帐时调用 #clearScrap()。

source: The camera's distance affects 3D transformations, for instance rotations around the X and Y axis.
zh_cn: 相机的距离会影响 3D 变换，例如围绕 X 轴和 Y 轴的旋转。

source: The chain's "head" view (the left-most view in a horizontal chain and the top-most view in a vertical chain) defines the chain's style in XML.
zh_cn: 链的 '头部' view(水平链中最左侧的 view 和垂直链中最顶部的 view)在 XML 中定义为链的样式。

source: The child drawing order can be overridden with ViewGroup#setChildrenDrawingOrderEnabled(boolean) in a ViewGroup, and with setZ(float) custom Z values} set on Views.
zh_cn: 子 view 的绘制顺序可以通过 ViewGroup 的 ViewGroup#setChildrenDrawingOrderEnabled(boolean) 覆盖，并通过 setZ(float) 将自定义的 Z 值设置在 view 上。

source: The child drawing order can be overridden with custom child drawing order in a ViewGroup, and with setZ(float) custom Z values} set on Views.
zh_cn: 子 view 的绘制顺序可以通过 ViewGroup 的 custom child drawing order 重写，并通过 setZ(float) 将自定义的 Z 值设置在 view 上。

source: The child must guarantee that it and all of its descendants will fit within this size.
zh_cn: 子项必须保证它和它的所有后代都适合这个尺寸。

source: The child must use this size, and guarantee that all of its descendants will fit within this size.
zh_cn: 子 view 必须用这个尺寸，并保证所有的子 view 都在这个尺寸内。

source: The child's weight that we can use to distribute the available horizontal space in a chain, if the dimension behaviour is set to MATCH_CONSTRAINT
zh_cn: 如果尺寸行为设置为 MATCH_CONSTRAINT，该 child 的权重可以用来分配链中可用的水平空间。

source: The child's weight that we can use to distribute the available vertical space in a chain, if the dimension behaviour is set to MATCH_CONSTRAINT
zh_cn: 如果尺寸行为是 MATCH_CONSTRAINT，我们使用的 child 的权重可以分配链中可用的垂直空间。

source: The children of a TableLayout cannot specify the layout_width attribute.
zh_cn: TableLayout 的子项不能指定 layout_width 属性。

source: The children of a TableRow do not need to specify the layout_width and layout_height attributes in the XML file.
zh_cn: TableRow 的子项不需要在 XML 文件中指定 layout_width 和 layout_height 属性。

source: The class is defined with the following line:
zh_cn: 该类使用以下行定义：

source: The client app that receives the content URI can open the file and access its contents by calling ContentResolver.openFileDescriptor to get a ParcelFileDescriptor.
zh_cn: 接收到 content URI 的客户端应用程序可以通过调用 ContentResolver.openFileDescriptor 来获取一个 ParcelFileDescriptor 以打开文件和访问内容。

source: The client can customize whether only the spinners, or only the calendar view, or both to be displayed.
zh_cn: 客户端可以自定义是仅显示旋转器，还是仅显示日历 view 或两者。

source: The clip will be based on the horizontal gravity: a left gravity will clip the right edge, a right gravity will clip the left edge, and neither will clip both edges.
zh_cn: 剪辑将基于水平重力：左重力将剪切右边缘，右重力将剪切左边缘，并且两者都不是则会剪切两个边缘。

source: The clip will be based on the vertical gravity: a top gravity will clip the bottom edge, a bottom gravity will clip the top edge, and neither will clip both edges.
zh_cn: 剪辑将基于垂直重力：顶部重力将剪切底部边缘，底部重力将剪切顶部边缘，并且两者都不是则会剪切两个边缘。

source: The code styles below are strict rules for contributing Java code to the Android Open Source Project (AOSP).
zh_cn: 下面的代码样式是为 Android 开源项目(AOSP)贡献 Java 代码的严格规则。

source: The collapse button appears at the start of the toolbar when an action view is present .
zh_cn: 当存在操作 view 时，折叠按钮将显示在工具栏的开头。

source: The collapsed height is defined by the view's minimum height.
zh_cn: 折叠高度由 view 的最小高度定义。

source: The color for the dates of an unfocused month.
zh_cn: 未聚焦月份日期的颜色。

source: The color for the dates of the focused month.
zh_cn: 焦点月份日期的颜色。

source: The color for the separator line between weeks.
zh_cn: 周之间分隔线的颜色。

source: The color for the week numbers.
zh_cn: 周数的颜色。

source: The color is specified with an RGB value and alpha channel.
zh_cn: 颜色由 RGB 值和 alpha 通道指定。

source: The components are stored as follows (alpha << 24) | (red << 16) | (green << 8) | blue.
zh_cn: 组件存储如下 (alpha << 24) | (red << 16) | (green << 8) | blue 。

source: The composite group made of these two elements is flexible if one of its elements is flexible.
zh_cn: 由两个元素组成的复合组是灵活的，如果其中 一个 元素是灵活的。

source: The container TabHost is used to add labels, add the callback handler, and manage callbacks.
zh_cn: 容器 TabHost 用于添加标签，添加回调处理程序和管理回调。

source: The container object for this widget is TabHost.
zh_cn: 此小部件的容器对象是 TabHost。

source: The content description will be read via screen readers or other accessibility systems to explain the action of the collapse button.
zh_cn: 将通过屏幕阅读器或其他辅助功能系统读取内容描述，以解释折叠按钮的操作。

source: The content description will be read via screen readers or other accessibility systems to explain the action of the navigation button.
zh_cn: 将通过屏幕阅读器或其他辅助功能系统读取内容描述，以解释导航按钮的操作。

source: The content inset affects the valid area for Toolbar content other than the navigation button and menu.
zh_cn: 内容内缩会影响除导航按钮和菜单之外的工具栏内容的有效区域。

source: The content stream can come from the application's process as well as a remote process.
zh_cn: 内容流可以来自应用程序的进程以及远程进程。

source: The content view is positioned using the layout of the parameters of the Placeholder (the Placeholder is simply constrained in the layout like any other view).
zh_cn: 使用 Placeholder 的参数布局定位内容view(Placeholder 与其他任何 view 一样，仅在布局中受到约束)。

source: The context menu information set by an ExpandableListView will be a ExpandableListContextMenuInfo object with ExpandableListContextMenuInfo#packedPosition being a packed position that can be used with getPackedPositionType(long) and the other similar methods.
zh_cn: 由 ExpandableListView 设置的上下文菜单信息将是 ExpandableListContextMenuInfo 对象，其中 ExpandableListContextMenuInfo#packedPosition 是一个打包位置，可以与 getPackedPositionType(long) 和其他类似的方法一起使用。

source: The converter tool always automatically skips 9-patch images.
zh_cn: 转换器工具始终会自动跳过 9-patch 图像。

source: The corresponding classes in the sample code are List4.java and List6.java.
zh_cn: 示例中对应的源码是 List4.java 和 List6.java。

source: The current behavior or null if no behavior is specified
zh_cn: 当前行为，如果未指定行为，则为 null

source: The current implementation necessitates that the reused bitmap be mutable, and the resulting reused bitmap will continue to remain mutable even when decoding a resource which would normally result in an immutable bitmap.
zh_cn: 当前的实现需要重用的位图是可变的，并且即使解码通常会导致不可变的位图的资源，所得到的重用位图也将继续保持可变。

source: The current target will receive an ACTION_CANCEL event, and no further messages will be delivered here.
zh_cn: 当前目标将收到 ACTION_CANCEL 事件，此处不会再传递任何消息。

source: The currently running instance of activity B in the above example will either receive the new intent you are starting here in its onNewIntent() method, or be itself finished and restarted with the new intent.
zh_cn: 上述示例中 activity B 的当前运行实例将在其 onNewIntent() 方法中接收你开始的新 intent，或者 finish 并使用新 intent 重新启动。

source: The custom View is defined in the LabelView class.
zh_cn: 自定义 view 定义在 LabelView 类中。

source: The custom component is created as a generic view in the XML, and the class is specified using the full package.
zh_cn: 该自定义组件在 XML 中被视为一个通用的 view 创建，并且这个类要使用完整的包名。

source: The decoded bitmap, or null if the image data could not be decoded, or, if opts is non-null, if opts requested only the size be returned (in opts.outWidth and opts.outHeight)
zh_cn: 已解码的位图，返回 null 如果图像数据无法解码，或者，如果 opts 非空，如果 opts 只请求返回大小(在 opts.outWidth 和 opts.outHeight 中)

source: The decoded bitmap, or null if the image data could not be decoded.
zh_cn: 解码的位图，如果无法解码图像数据，则为 null。

source: The default AppBarLayout.Behavior for AppBarLayout.
zh_cn: AppBarLayout 的默认 AppBarLayout.Behavior。

source: The default AudioAttributes used during playback have a usage of AudioAttributes#USAGE_MEDIA and a content type of AudioAttributes#CONTENT_TYPE_MOVIE, use setAudioAttributes(android.media.AudioAttributes) to modify them.
zh_cn: 播放期间使用的默认 AudioAttributes 使用 AudioAttributes#USAGE_MEDIA，内容类型 AudioAttributes#CONTENT_TYPE_MOVIE，使用 setAudioAttributes(android.media.AudioAttributes) 进行修改。

source: The default action here is to cancel long press.
zh_cn: 这里的默认动作是取消长按。

source: The default behavior can be overridden using setBehavior(CoordinatorLayout.Behavior).
zh_cn: 可以使用 setBehavior(CoordinatorLayout.Behavior) 覆盖默认行为。

source: The default behavior of a chain is to spread the elements equally in the available space.
zh_cn: 链的默认行为是在可用空间中平均分配元素。

source: The default implementation of this method returns 0, making the assumption of a single view type for the adapter.
zh_cn: 此方法的默认实现返回 0，假设适配器只有一个 view 类型。

source: The default implementation of this method returns #NO_ID.
zh_cn: 此方法的默认实现返回 #NO_ID。

source: The default implementation returns the given position.
zh_cn: 默认实现返回给定的位置。

source: The default implementation returns true for compatibility reasons.
zh_cn: 出于兼容性原因，默认实现返回 true。

source: The default implementation sets the bounds of outRect to 0 and returns.
zh_cn: 默认的实现设置了 outRect 的边界为 0 并返回。

source: The default orientation is horizontal.
zh_cn: 默认方向是水平的。

source: The default settings depend on the minSdkVersion setting for the current module.
zh_cn: 默认设置取决于当前模块的 minSdkVersion 设置。

source: The default state of the SearchView.
zh_cn: SearchView 的默认状态。

source: The default style for an ExpandableListView provides indicators which will be shown next to Views given to the ExpandableListView.
zh_cn: ExpandableListView 的默认样式提供了指示符，这些指示符将显示在给予 ExpandableListView 的 view 旁边。

source: The default style for this view is R.style.Widget_FragmentBreadCrumbs.
zh_cn: 此 view 的默认样式为 R.style.Widget_FragmentBreadCrumbs。

source: The default values for the Gallery assume you will be using R.styleable.Theme_galleryItemBackground as the background for each View given to the Gallery from the Adapter.
zh_cn: Gallery 的默认值假设你将使用 R.styleable.Theme_galleryItemBackground 作为从适配器提供给 Gallery 的每个 View 的背景。

source: The default when encountering such opposite constraints is to center the widget; but you can tweak the positioning to favor one side over another using the bias attributes:
zh_cn: 遇到这样的相反约束时的默认值是使窗口小部件居中; 但是你可以使用偏见属性来调整定位，使其偏向另一侧：

source: The density scale factor of a high density display is 1.5, and 1920 = 1280 * 1.5.
zh_cn: 高密度显示器的密度比例因子是 1.5，并且 1920 = 1280 * 1.5。

source: The design is very similar to ArrayMap, with all of the caveats described there.
zh_cn: 该设计与 ArrayMap 非常相似，这里描述了所有的注意事项。

source: The design time location of the left side of the child.
zh_cn: child 的左边的设计时的位置。

source: The design time location of the right side of the child.
zh_cn: child 的右边的设计时的位置。

source: The dialog shows the file size for the original and the converted image.
zh_cn: 该对话框显示原始图像和转换图像的文件大小。

source: The dimension of the widgets can be specified by setting the android:layout_width and android:layout_height attributes in 3 different ways:
zh_cn: 可以通过以下 3 种方式设置 android:layout_width 和 android:layout_height 属性来指定小部件的尺寸。

source: The dimension will expand up to the constraints, minus margins
zh_cn: 尺寸将扩展至约束，减去 margin 值。

source: The direction of the row can be set by calling setOrientation().
zh_cn: 可以通过调用 setOrientation() 来设置行的方向。

source: The distance is expressed in "depth pixels." The default distance depends on the screen density.
zh_cn: 距离以“深度像素”表示。默认距离取决于屏幕密度。

source: The distance of child (guideline) to the top or left edge of its parent.
zh_cn: child(guideline)到它的 parent 的顶边或左边的距离。

source: The distance of the camera from the view plane can have an affect on the perspective distortion of the view when it is rotated around the x or y axis.
zh_cn: 当相机围绕 x 轴或 y 轴旋转时，相机与 view 平面的距离会影响 view 的透视畸变。

source: The documentation of each individual alpha compositing or blending mode below provides the exact equation used to compute alpha and color value of the result of the composition of a source and destination.
zh_cn: 以下每个单独的 alpha 合成或混合模式的文档提供了用于计算源和目标的合成结果的 alpha 值和颜色值的确切公式。

source: The down event will be handled either by a child of this view group, or given to your own onTouchEvent() method to handle; this means you should implement onTouchEvent() to return true, so you will continue to see the rest of the gesture (instead of looking for a parent view to handle it).
zh_cn: down 事件将由此 view group 的一个 child 处理，或者由你自己的 onTouchEvent() 方法处理；这意味着你应该实现 onTouchEvent() 以返回 true，这样你将继续看到手势的其余部分(而不是寻找 parent view 来处理它)。

source: The drawback is that ValueAnimator is not available prior to API level 11, so this technique cannot be used on devices running Android versions lower than 3.0.
zh_cn: 缺点是在 API 级别 11 之前 ValueAnimator 不可用，因此该技术不能用于运行低于 3.0 的 Android 版本的设备。

source: The drop down can be dismissed at any time by pressing the back key or, if no item is selected in the drop down, by pressing the enter/dpad center key.
zh_cn: 可以通过按后退键随时解除下拉，如果在下拉列表中未选择任何项目，则按下输入/ dpad 中心键可以解除下拉。

source: The easiest way to transition back to your normal theme is to call setTheme(R.style.AppTheme) before calling super.onCreate() and setContentView():
zh_cn: 转换回正常主题的最简单方法是在调用 super.onCreate() 和 setContentView() 之前调用 setTheme(R.style.AppTheme)：
